project/app/Controllers/Admin.php

    public function forum()
    {
        if(!session()->has('isLogged')){
            return redirect()->to('adminlogin');
        }

        $forumsmodel = model('Forum_model');
        $data['forums'] = $forumsmodel->paginate(10);
---
SELECT *
FROM `forum`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `forum`

    public function delete($id)
    {
        if(!session()->has('isLogged')){
            return redirect()->to('adminlogin');
        }

        $forumsmodel = model('Forum_model');
        $forumsmodel->delete($id);

        $replyModel = model('Reply_model');
        $replyModel->where('forumid', $id)->delete();
---
DELETE FROM `reply`
WHERE `id` IN ('2')

    public function replydelete($id)
    {
        if(!session()->has('isLogged')){
            return redirect()->to('adminlogin');
        }

        $replyModel = model('Reply_model');
        $replyModel->delete($id);

        $forumsmodel = model('Forum_model');
        $data['forum'] = $forumsmodel->find($id);

        return redirect()->to('adminforumview/'.$id)->with('success', 'Reply deleted successfully!')->with('data', $data);
---
SELECT *
FROM `forum`
WHERE `forum`.`id` = '2'
SELECT *
FROM `reply`
WHERE `forumid` = '2'

    public function forumview($id)
    {
        if(!session()->has('isLogged')){
            return redirect()->to('adminlogin');
        }

        $forumsmodel = model('Forum_model');
        $data['forum'] = $forumsmodel->find($id);

        $replysmodel = model('Reply_model');
        $data['replys'] = $replysmodel->where('forumid', $id)->findAll();
---
SELECT *
FROM `forum`
WHERE `forum`.`id` = '2'
SELECT *
FROM `reply`
WHERE `forumid` = '2'