project/app/Controllers/Index.php

SELECT *
FROM `forum`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `forum`
---
    public function index()
    {
        $forumsmodel = model('Forum_model');
        $data['forums'] = $forumsmodel->paginate(10);

INSERT INTO `forum` (`username`, `message`) VALUES ('yeah', 'damn')
---
    public function create()
    {
        helper('form');
        if($this->request->getMethod() === 'POST') {
            $forummodel = model('Forum_model');

            $registerdata = $this->request->getPost([
                'username',
                'message'
            ]);

            $forummodel->insert($registerdata);

SELECT *
FROM `forum`
WHERE `forum`.`id` = '2'
SELECT *
FROM `reply`
WHERE `forumid` = '2'
---
    public function forumview($id)
    {
        $forumsmodel = model('Forum_model');
        $data['forum'] = $forumsmodel->find($id);

        $replysmodel = model('Reply_model');
        $data['replys'] = $replysmodel->where('forumid', $id)->findAll();

INSERT INTO `reply` (`username`, `message`, `forumid`) VALUES ('reply test', 'lets go', '2')
---
    public function forumreply($id)
    {
        helper('form');
        if($this->request->getMethod() === 'POST') {
            $replymodel = model('Reply_model');

            $registerdata = $this->request->getPost([
                'username',
                'message'
            ]);

            $registerdata['forumid'] = $id;

            $replymodel->insert($registerdata);